{
	"version":"0.2",
	"Adepta Sororitas": {
		"Hallowed Martyrs": {
			"Divine Intervention": {
				"flavour":"The pious believe that, in their moment of greatest need, the Emperor protects.",
				"type": "Epic Deed",
				"cost": 1,
				"when": "Any Phase",
				"target": "One Adepta Sororitas Character unit from your army that was just destroyed. You can use this Stratagem on that unit even though it was just destroyed.",
				"effect": "Discard 1-3 Miracle dice. At the end of the phase, set the last destroyed model from your unit back up on the battlefield, as close as possible to where it was destroyed and not within Engagement Range of any enemy models. That model is set back up with a number of wounds remaining equal to the number of Miracle dice you discarded.",
				"restrictions": "You cannot select Saint Celestine as the target of this Stratagem. You cannot select the same Character as the target of this Stratagem more than once per battle."
			},
			"Suffering and Sacrifice": {
				"flavour":"Suffering is a staple for the Adepta Sororitas, and a martyr's fate only bring glory to the God-Emperor.",
				"type": "Strategic Ploy",
				"cost": 1,
				"when": "Start of the Fight Phase",
				"target": "One Adepta Sororitas Infantry of Adepta Sororitas Walker from your army.",
				"effect": "Until the end of the phase, each time an enemy model whose unit is within Engagement range of your unit selects its targets, it must select your unit as the target of its attacks.",
				"restrictions": ""
			},
			"Righteous Vengeance": {
				"flavour":"With the Emperor's light upon them, the righteous vengeance of the Sisters of Battle burns brighter.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Fight Phase",
				"target": "One Adepta Sororitas unit from your army that has not been selected to fight this phase.",
				"effect": "Until the end of the phase, each time a model in your unit makes an attack, you can re-roll the Hit roll and, if your unit is below Half-Strength, you can re-roll the Wound roll as well.",
				"restrictions": ""
			},
			"Sanctified Immolation": {
				"flavour":"The enemy must perish, even if we perish with them. The enemy must burn, even if we burn with them.",
				"type": "Strategic Ploy",
				"cost": 1,
				"when": "Any Phase",
				"target": "One Adepta Sororitas Vehicle model from your army with the Deadly Demise ability that was just destroyed. You can use this Stratagem on that model even though it was just destroyed.",
				"effect": "Do not roll one D6 to determine whether mortal wounds are inflicted by your model's Deadly Demise ability. Instead, mortal wounds are automatically inflicted.",
				"restrictions": ""
			},
			"Spirit of the Martyr": {
				"flavour":"Even with their dying act, the Adepta Sororitas mete out the Emperor's judgement.",
				"type": "Strategic Ploy",
				"cost": 2,
				"when": "Fight Phase, just after an enemy unit has selected its targets.",
				"target": "One Adepta Sororitas unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
				"effect": "Until the end of that phase, each time a model in your unit is destroyed, if taht model has not fought this phase, do not remove it from play. The destroyed model can fight after the attacking unit has finished making its attacks, and is then removed from play.",
				"restrictions": ""
			},
			"Praise the Fallen": {
				"flavour":"The death of a Battle Sister only stirs the survivors to fight harder to exact swift vengeance.",
				"type": "Strategic Ploy",
				"cost": 1,
				"when": "Your opponent's Shooting Phase, just after an enemy unit has shot.",
				"target": "One Adepta Sororitas unit from your army that had one or more of its models destroyed as a result of the attacking unit's attacks.",
				"effect": "Your unit can shoot as if it were your Shooting phase, but it must target only that enemy unit when doing so, and can only do so if that enemy unit is an elligible target.",
				"restrictions": ""
			}

		},

		"Penitent Host": {
			"Final Redemption": {
				"flavour":"Those seeking absolution in the eyes of the Emperor will gladly give their last drop of blood to defy his enemies.",
				"type": "Epic Deed",
				"cost": 1,
				"when": "Any Phase",
				"target": "One Penitent unit from your army that was just destroyed while it was within range of an objective marker you controlled. You can use this Stratagem on that unit even though it was just destroyed.",
				"effect": "That objective marker remains under your control, even if you have no models within range of it, until your opponent controls it at the start or end of any turn.",
				"restrictions": ""
			},
			"Purity of Suffering": {
				"flavour":"Suffering is the penance by which the faithful affirm their devotions. To share in the agonies suffered by the God-Emperor and his saints without embracing death is the mark of fidelity to the Imperial Creed.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Your opponent's Shooting Phase or the Fight Phase, just after an enemy has selected its targets.",
				"target": "One Penitent unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
				"effect": "Until the end of the phase, Penitent models in your unit have the Feel No Pain 4+ ability.",
				"restrictions": ""
			},
			"Passion of the Penitent": {
				"flavour":"The penitent are full of a burning passion to inflict suffering upon the faithless.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Fight Phase",
				"target": "One Penitent unit from your army that has not been selected to fight this phase.",
				"effect": "Until the end of the phase, each time a Penitent model in your unit makes a melee attack, a successful unmodified Hit roll of 5+ scores a Critical Hit.",
				"restrictions": ""
			},
			"Lash of Guilt": {
				"flavour":"Agony and guilt drive these sinners forward. Only by meeting the enemy in combat may they find repentance or, failling that, the comfort of death.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Your Movement Phase, just before a Penitent unit from your army Advances.",
				"target": "That Penitent unit.",
				"effect": "Until the end of the turn, your unit is elligible to declare a charge in a turn in which it Advanced. If your unit has the Penitent Engines keyword, do not make an advance roll for it; instead, until the end of the phase, add 6\" to the Move characteristic of models in your unit.",
				"restrictions": ""
			},
			"Boundless Zeal": {
				"flavour":"The urge to absolve their sins and destroy the enemy drives the penitents to push their tortured bodies beyond their normal limits.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Your Movement Phase, just after an Adepta Sororitas unit from your army Falls Back.",
				"target": "That Adepta Sororitas unit.",
				"effect": "Until the endo of the turn, your unit is elligible to shoot or declare a charge in a turn in which it Fell Back. If your unit has the Penitent keyword, it is elligible to shoot and declare a charge in a turn in which it Fell Back.",
				"restrictions": ""
			},
			"Devout Fanaticism": {
				"flavour":"The God-Emperor's faithful followers, heedless of incoming fire, leap forth to deliver his furious judgement in the press of melee.",
				"type": "Strategic Ploy",
				"cost": 1,
				"when": "Your opponent's Shooting Phase, just after an enemy unit has selected its targets.",
				"target": "One Penitent unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
				"effect": "Roll one D6: your unit can be moved a distance in inches up to the result, but it must end that move as close as possible to the closest enemy unit (excluding Aircraft). When doing so, models in your unit can be moved within Engagement Range of enemy units.",
				"restrictions": ""
			}
		},

		"Champions of Faith": {
			"Shield of Denial": {
				"flavour":"With so singular and fanatical a purpose, the Adepta Sororitas can will their injuries away, at least until the fight is done.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Any phase, just after a mortal wound is allocated to an Adepta Sororitas unit from your army.",
				"target": "That Adepta Sororitas unit.",
				"effect": ": Until the end of the phase, models in your unit have the Feel No Pain 6+ ability against mortal wounds. If your unit is Righteous, until the end of the phase, models in your unit have the Feel No Pain 5+ ability against mortal wounds instead.",
				"restrictions": ""
			},
			"Suffer not the Unfaithful": {
				"flavour":"No unclean foe can be permitted to stand between the Go‑Emperor’s sworn champions and their oathed duty. They must be struck down with unmerciful fury. ",
				"type": "Strategic Ploy",
				"cost": 1,
				"when": "Fight Phase",
				"target": "One Adepta Sororitas unit from your army that has not been selected to fight this phase.",
				"effect": "Until the end of the phase, melee weapons equipped by models in your unit have the Lethal Hits ability. If one or more enemy models are destroyed as the result of attacks made by those weapons this phase, select one of those destroyed models; that destroyed model's unit take a Battle-Shock test.",
				"restrictions": ""
			},
			"To the Heart of Heresy": {
				"flavour":"Seizing their moment to drive like a burning blade through the enemy lines and complete their holy mission, these faithful strike with unstoppable might.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Fight Phase",
				"target": "One Adepta Sororitas unit from your army that has not been selected to fight this phase",
				"effect": "Until the end of the turn, improve the Strength characteristic of melee weapons equipped by models in your unit by 1. If your unit is Righteous, until the end of the phase, improve the Armour Penetration characteristic of melee weapons equipped by models in your unit by 1 as well.",
				"restrictions": ""
			},
			"Path of the Righteous": {
				"flavour":"When exemplars of the Imperial Creed stride to do the God‑Emperor’s will, little can slow their sacred procession.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Fight Phase",
				"target": "One Adepta Sororitas unit from your army that has not been selected to fight this phase.",
				"effect": ": Until the end of the turn, each time a model in your unit makes a Pile‑in or Consolidation move, it can move up to 6\" instead of up to 3\". When doing so, if your unit is Righteous, it does not need to end that move closer to the closest enemy model, provided it ends that move as close as possible to the closest enemy unit.",
				"restrictions": ""
			},
			"Bastion of Faith": {
				"flavour":"Unified in their inviolate dedication to fulfil their oaths to Him on the Throne, the Order’s elite form a rampart of ceramite and unyielding faith to throw back the desperate blows of the foe. ",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Fight phase, just after an enemy unit has selected its targets.",
				"target": "One Celestian Sacresants unit that was selected as the target of one or more of the attacking unit’s attacks.",
				"effect": "Until the end of the phase, each time an attack targets your unit, subtract 1 from the Hit roll. In addition, if your unit is Righteous, you can select one other Celestian Sacresants unit from your army that is not Battle‑shocked and is within 6\" of your unit. Until the end of the phase, each time an attack targets that Celestian Sacresants unit, subtract 1 from the Hit roll as well.",
				"restrictions": ""
			},
			"Indefatigable Dedication": {
				"flavour":"Such champions of the God‑Emperor never stop fighting or striving for victory, transforming momentary retreats into another opportunity to purge the unclean and press on to their objective.",
				"type": "Strategic Ploy",
				"cost": 1,
				"when": "Your Movement phase, just after an Adepta Sororitas unit from your army Falls Back.",
				"target": "One Adepta Sororitas Transport unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
				"effect": "Until the end of the turn, your unit is eligible to shoot in a turn in which it Fell Back. If your unit is Righteous, until the end of the turn, your unit is eligible to shoot and declare a charge in a turn in which it Fell Back instead.",
				"restrictions": ""
			}
		},

		"Bringers of Flame": {
			"Shield of Aversion": {
				"flavour":"The Sisters of Battle gird themselves with the strength of their faith. It is a shield of repulsion that rejects the heretical cunning of their ennemies.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Your opponent's Shooting Phase or the Fight Phase, just after an enemy unit has selected its targets.",
				"target": "One Adepta Sororitas unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
				"effect": "Until the end of the phase, each time an attck targets your unit, worsen the Armour Penetration characteristic of that attack by 1.",
				"restrictions": ""
			},
			"Righteous Blows": {
				"flavour":"As the faithful strike in righteous anger, they feel the Emperor's hand adding strength to their blows.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Fight Phase",
				"target": "One Adepta Sororitas unit from your army that has not been selected to fight this phase.",
				"effect": "Until the end of the phase, melee weapons equipped by models in your unit have the Lethal Hits ability. If one or more enemy models are destroyed as the result of attacks made by those weapons this phase, select one of those destroyed models; that destroyed model's unit take a Battle-Shock test.",
				"restrictions": ""
			},
			"Carry Forth the Faithful": {
				"flavour":"Congregated within a transport, the Battle Sisters recite bellowing prayers so that the whole vehicle echoes to furious piety.",
				"type": "Strategic Ploy",
				"cost": 1,
				"when": "Your Movement Phase, just before an Adepta Sororitas Transport model from your army Advances.",
				"target": "That Adepta Sororitas Transport model.",
				"effect": "Until the end of the turn, you can re-roll Advance rolls made for your Transport, and units can disembark from your Transport even though it Advanced. Units that do so count as having made a Normal move, and cannot declare a charge this turn.",
				"restrictions": ""
			},
			"Cleansing Flames": {
				"flavour":"Burn the mutant. Burn the heretic. Burn the witch.",
				"type": "Battle Tactic",
				"cost": 2,
				"when": "Your Shooting Phase",
				"target": "One Adepta Sororitas unit from your army that has not been selected to fight this phase.",
				"effect": "Until the end of the phase, Torrent weapons equipped by models in your unit have the Devastating Wounds ability.",
				"restrictions": ""
			},
			"Rites of Fire": {
				"flavour":"At close range, the Adepta Sororitas unleash the full devastating potential of their blessed weapons.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Your Shooting Phase",
				"target": "One Adepta Sororitas unit from your army that disembarked from a Transport this turn and has not been selected to shoot this phase.",
				"effect": "Until the end of the phase, each time a model in your unit makes a ranged attack that targets an enemy unit within 12\" that is also within range of an objective marker, add 1 to the Wound roll. If one or more enemy models are destroyed as the result of those attacks, select one of those destroyed models; that destroyed model's unit must take a Battle-Shock test.",
				"restrictions": ""
			},
			"Blazing Ire": {
				"flavour":"The transports of the Adepta Sororitas are mobile shrines. The Sisters within this vehicle recite psalms of righteous hatred and destruction before emerging to obliterate their foes.",
				"type": "Battle Tactic",
				"cost": 2,
				"when": "Your opponent's Shooting Phase, just after an enemy unit has shot.",
				"target": "One Adepta Sororitas Transport unit from your army that was selected as the target of one or more of the attacking unit's attacks.",
				"effect": "One unit embarked within your Transport can disembark as if it were your Movement Phase, and can then shoot as if it were your Shooting Phase, but must target only that enemy unit when doing so, and can only do so if that enemy unit is an elligible target.",
				"restrictions": ""
			}
		},

		"Army of Faith": {
			"Shield of Faith": {
				"flavour":"There is no armor as resilient as conviction itself.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Any Phase, jsut after an Adepta Sororitas unit from your army suffers a Mortal Wound",
				"target": "That Adepta Sororitas unit, or one friendly Adepta Sororitas Jump Pack unit within 3\" of it.",
				"effect": "Until the end of the phase, models in your unit have the Feel No Pain 5+ ability against Mortal Wounds. If you targeted an Adepta Sororitas Jump Pack unit from your army with this Stratagem, then until the end of the phase, whild a friend Adepta Sororitas unit if within 3\" of your unit, models in that unit have the Feel No Pain 5+ ability against Mortal Wounds.",
				"restrictions": ""
			},
			"Light of the Emperor": {
				"flavour":"The Emperor's radiance shines upon his warriors, magnifying their purity in their darkest hour.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Command Phase",
				"target": "One Adepta Sororitas unit from your army.",
				"effect": "Until the end of the turn, your unit is blessed. While a unit is blessed, it can ignore any or all modifiers to the following: the profile characteristics of its models; the Weapon Skill or Balistic Skill characteristics of weapons equipped by its models; any roll or test made for it (excluding modifiers to Saving Throws). If your unit has the Jump Pack keyword, until the end of the turn, while a friendly Adepta Sororitas unit is within 3\" of your unit, that friendly unit is also blessed.",
				"restrictions": ""
			},
			"Faith and Fury": {
				"flavour":"The righteous zeal of the Sisters of Battle burns bright as they charge towards their foes.",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Fight Phase",
				"target": "One Adepta Sororitas unit from your army that has not been selected to fight this phase.",
				"effect": "Until the end of the phase, melee weapons equipped by models in your unit have the Lance ability. If one or more enemy models are destroyed as the result of your unit's attacks this phase, you gain 1 Miracle Dice.",
				"restrictions": ""
			},
			"Blinding Radiance": {
				"flavour":"The Emperor's divinity manifests in golden halos, blinding the enemy with radiant light.",
				"type": "Strategic Ploy",
				"cost": 1,
				"when": "Your opponent's Shooting Phase or the Fight Phase, just after an enemy unit has selected its targets.",
				"target": "One Adepta Sororitas unit from your army that was selected as the target of one or more of the attacking unit's attacks, or one friendly Adepta Sororitas Jump Pack unit within 3\" of such a unit.",
				"effect": "Until the end of the phase, each time an attck targets your unit, substract 1 from the Hit Roll. If you targeted an Adepta Sororitas Jump Pack unit from your army with this Stratagem, then until the end of the phase, while a friendly Adepta Sororitas unit is within 3\" of your unit, each time an attack targets that unit, substract 1 from the Hit Roll.",
				"restrictions": ""
			},
			"Divine Guidance": {
				"flavour":"With miraculous precision, the blows of the Sisters of Battle strike the weak points of enemy armour. ",
				"type": "Battle Tactic",
				"cost": 1,
				"when": "Your Shooting Phase or the Fight Phase.",
				"target": "One Adepta Sororitas unit from your army that has not been selected to shoot or fight this phase.",
				"effect": "Until the end of the phase, each time a model in your unit makes an attack, improve te Armour Penetration characteristic of that attack by 1. If one or more enemy models are destroyed as the result of any of those attacks, you gain 1 Miracle Dice.",
				"restrictions": ""
			},
			"Angelic Ascent": {
				"flavour":"On wings of fire do the angelic warriors of the Orders Militant descent to battle.",
				"type": "Strategic Ploy",
				"cost": 1,
				"when": "End of your opponent's Fight Phase.",
				"target": "One Adepta Sororitas Jump Pack unit from your army.",
				"effect": "Remove your unit from the battlefield and place it into Strategic Reserves.",
				"restrictions": "You cannot select a unit that is within Engagement Range of one or more enemy units."
			}
		}
	},


	"Space Marines": {
		"Army of Faith": {
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			}
		}
	},


	"Death Guard": {
		"Army of Faith": {
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			},
			"Divine Intervention": {
				"flavour":"",
				"type": "Epic Deed",
				"cost": 1,
				"when": "any phase",
				"target": "",
				"effect": "",
				"restrictions": ""
			}
		}
	}
}
